In [2]:
import pandas as pd

In [3]:
parish2district = pd.read_csv('parish2district.csv')

In [4]:
parish2district.head()

,FID,PAR19CD,PAR19NM,WD19CD,WD19NM,LAD19CD,LAD19NM
0,1,E04000257,Greatham,E05008944,Fens and Rossmere,E06000001,Hartlepool
1,2,E04000258,Hart,E05008946,Hart,E06000001,Hartlepool
2,3,E04000260,Headland,E05008947,Headland and Harbour,E06000001,Hartlepool
3,4,E04000253,Brierton,E05008950,Rural West,E06000001,Hartlepool
4,5,E04000254,Claxton,E05008950,Rural West,E06000001,Hartlepool

In [5]:
areas = pd.read_csv('UKAreas.csv')

In [6]:
areas.head()

              Name     Type
0  East of England  Regions
1    East Midlands  Regions
2           London  Regions
3       North East  Regions
4       North West  Regions

In [7]:
p2areas = parish2district[['PAR19NM']]

In [8]:
p2areas['Type'] = 'Parish'
p2areas = p2areas.rename(columns={'PAR19NM': 'Name'})

/var/folders/fp/krc_7dfx3j5bpttbrg2p_vnr0000gn/T/ipykernel_32991/1993610312.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  p2areas['Type'] = 'Parish'

In [9]:
p2areas.head()

       Name    Type
0  Greatham  Parish
1      Hart  Parish
2  Headland  Parish
3  Brierton  Parish
4   Claxton  Parish

In [10]:
townsAndCities = pd.read_csv('townsandcities.csv')

In [11]:
townsAndCities.head()

   FID  TCITY15CD    TCITY15NM
0    1  J01000001     Barnsley
1    2  J01000002     Basildon
2    3  J01000003  Basingstoke
3    4  J01000004         Bath
4    5  J01000005      Bedford

In [12]:
townsAndCities['Type'] = 'Town'
townsAndCities = p2areas.rename(columns={'TCITY15NM': 'Name'})

In [39]:
wards = pd.read_csv('wards.csv', sep=';')
wards.head()

   Ward Code       Ward Name    LA Code
0  E05000026           Abbey  E09000002
1  E05000027          Alibon  E09000002
2  E05000028       Becontree  E09000002
3  E05000029  Chadwell Heath  E09000002
4  E05000030       Eastbrook  E09000002

In [40]:
del wards['LA Code']
del wards['Ward Code']

In [41]:
wards['Type'] = 'Ward'

        Ward Name
0           Abbey
1          Alibon
2       Becontree
3  Chadwell Heath
4       Eastbrook

In [13]:
areasWithParish = pd.concat([p2areas, areas, townsAndCities], ignore_index=True)

In [14]:
areasWithParish.tail()

                    Name    Type
27154              Clyro  Parish
27155           Glasbury  Parish
27156        Painscastle  Parish
27157  Castle Caereinion  Parish
27158         Guilsfield  Parish

In [15]:
vacancies = pd.read_csv('vacancies.csv', sep='|')

In [16]:
vacancies.head()

,id,id_x,job_title,source_id,job_sector,type,county,city,posted_by,publish_date,floor_wage,ceiling_wage,currency,job_description
0,0,1,Accounts Administrator. Ambitious IT Solutions...,26392152.0,part-time,"per annum, pro-rata",Castle Donington,Castle Donington,Signum Solutions Ltd,2015-01-19,"15,000","18,000",£,Signum Solutions Ltd is an ambitious IT Soluti...
1,1,2,Westside:- Branded High Fashion Retail Sales A...,26450070.0,part-time,"per hour, negotiable",London,London,Westside,2015-02-03,7.00,10.00,£,WESTSIDE LONDON We are a fashion retailer loca...
2,2,3,Reservations Sales Specialist,26340069.0,birmingham,per annum,Brierley Hill,Brierley Hill,IHG,2015-01-13,"15,838","16,233",£,"IHG, the world's most global hotel company, is..."
3,3,4,Marketing Assistant,26486503.0,birmingham,per annum,Birmingham,Birmingham,KSA Associates,2015-02-02,"18,000","20,000",£,We are a young and energetic Accountancy pract...
4,4,5,Store Manager,26477487.0,ireland,per annum,Ireland,Ireland,Reed,2015-02-03,"50,000","55,000",€,Job Description Highly experienced Store Manag...

In [17]:
vacancies.shape

(2054604, 14)

In [25]:
merged = vacancies.merge(areasWithParish, left_on='county', right_on='Name', how='left')

In [26]:
merged.shape

(3057561, 16)

In [27]:
non_matches = merged[merged['Name'].isna()]['county'].unique().tolist()

In [28]:
print(len(non_matches))

5780